app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def update
    chat = Chat.find(params[:id])