app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? ORDER BY "chats"."created_at" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? ORDER BY "chats"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "chats" WHERE "chats"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    @chats = current_user.chats.order(created_at: :desc)
    if @chats.any?
      redirect_to chat_url(@chats.first)

SELECT "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @chat = Chat.find(params[:id])

SELECT MAX("chats"."id") FROM "chats" WHERE "chats"."user_id" = ?  [["user_id", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? AND "chats"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
---
  def edit
    @chat = current_user.chats.find(params[:id])

SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? ORDER BY "chats"."created_at" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "chats" ("user_id", "history", "q_and_a", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["history", "\"{\\\"messages\\\":[]}\""], ["q_and_a", nil], ["created_at", "2024-11-21 17:40:59.172943"], ["updated_at", "2024-11-21 17:40:59.172943"], ["name", "Chat 23"]]
---
  def create
    # Fetch the user's chats and determine the next number
    last_chat = current_user.chats.order(:created_at).last
    next_number = last_chat ? last_chat.name.scan(/\d+/).last.to_i + 1 : 1

    # Create the new chat
    @chat = current_user.chats.build(
      name: "Chat #{next_number}",
      history: { messages: [] }.to_json
    )

    if @chat.save

SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? AND "chats"."id" = ? LIMIT ?  [["user_id", 1], ["id", 17], ["LIMIT", 1]]
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 17]]
---
  def destroy
    @chat = current_user.chats.find(params[:id]) # Ensures chat belongs to current_user
    if @chat.destroy

SELECT MAX("chats"."id") FROM "chats" WHERE "chats"."user_id" = ?  [["user_id", 1]]
SELECT "chats"."id" FROM "chats" WHERE "chats"."user_id" = ?  [["user_id", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? AND "chats"."id" = ? LIMIT ?  [["user_id", 1], ["id", 17], ["LIMIT", 1]]
---
    def set_chat
      Rails.logger.debug "Chat ID: #{params[:id]}"
      Rails.logger.debug "Available Chats: #{current_user.chats.pluck(:id)}"
      @chat = current_user.chats.find(params[:id])