app/views/layouts/chat.html.erb

                <ul class="list-unstyled">
                <%= render partial: "chats/chat_list", collection: current_user.chats.order(created_at: :desc), as: :chat %>
---
SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? ORDER BY "chats"."created_at" DESC  [["user_id", 1]]